易宠科技PHP笔试题

1.session与cookie是什么他们的区别
2.$a='hello',$b='2',不引用第三个变量实现两个变量值叫唤
3.cgi是什么，fastcgi, php-fpm,请简单描述
4.浅谈面向对象，封装继承多态
5.date='2012-02-11 14:00'求上一月的最后天日期
6.浅谈myisam innodb区别
7.说说浏览器发起请求时，所涉及到的所有缓存
8，mysql优化越详细越好
9.解决高并发下抢购问题，怎么实现
10.给出一个目录遍历其所有子目录和文件，核心代码
11.谈谈你所使用过的框架，优缺点
12.什么是事务
13.截取字符串且不出现乱码的方法
14.MYSQL查询有一道，查询members表中test不重复的项目  members  id, test
15.请为下表添加适当的索引 table  id code
16.方法实现二维数组分别按 key1, key2排序
人事
从毕业到现在经历，自我介绍
如何看待摔锅
怎样看待上级
希望上级哪种类型
未来规划打算
项目上遇到的问题如何解决
业余活动
遇到拖延症同事怎么办
为什么离职
说说印象最深的项目，遇到问题如何解决的
公司构造规模
工作空闲时做什么
关注什么技术论坛

汇博面试
1. linux 基础指令，查看某路径下文件内容
2. 求X的N次方的方法，要求时间复杂度越低越好
3. 一对兔子一个月生出一对新兔子，3个月后长大的兔子又会生出一对兔子，求一年后一共多少对兔子（递归）
4. 现有一个2G大的日志文件，统计出其中访问最多的IP地址，并排出前10个
5.  $a='hello',$b='2',不引用第三个变量实现两个变量值交换
口面
数据库优化
搜索引擎
nosql
数据库设计注意的细节
人事
工作经历
